espressif/esp-idf/components/soc/esp32s3/include/soc/extmem_reg.h
// Copyright 2017-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#pragma once

#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define EXTMEM_DCACHE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x0)
/* EXTMEM_DCACHE_BLOCKSIZE_MODE : R/W ;bitpos:[4:3] ;default: 2'b0 ; */
/*description: The bit is used to configure cache block size.0: 16 bytes, 1: 32 bytes,2: 64 byt
es.*/
#define EXTMEM_DCACHE_BLOCKSIZE_MODE    0x00000003
#define EXTMEM_DCACHE_BLOCKSIZE_MODE_M  ((EXTMEM_DCACHE_BLOCKSIZE_MODE_V)<<(EXTMEM_DCACHE_BLOCKSIZE_MODE_S))
#define EXTMEM_DCACHE_BLOCKSIZE_MODE_V  0x3
#define EXTMEM_DCACHE_BLOCKSIZE_MODE_S  3
/* EXTMEM_DCACHE_SIZE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to configure cache memory size.0: 32KB, 1: 64KB.*/
#define EXTMEM_DCACHE_SIZE_MODE    (BIT(2))
#define EXTMEM_DCACHE_SIZE_MODE_M  (BIT(2))
#define EXTMEM_DCACHE_SIZE_MODE_V  0x1
#define EXTMEM_DCACHE_SIZE_MODE_S  2
/* EXTMEM_DCACHE_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to activate the data cache. 0: disable, 1: enable.*/
#define EXTMEM_DCACHE_ENABLE    (BIT(0))
#define EXTMEM_DCACHE_ENABLE_M  (BIT(0))
#define EXTMEM_DCACHE_ENABLE_V  0x1
#define EXTMEM_DCACHE_ENABLE_S  0

#define EXTMEM_DCACHE_CTRL1_REG          (DR_REG_EXTMEM_BASE + 0x4)
/* EXTMEM_DCACHE_SHUT_CORE1_BUS : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: The bit is used to disable core1 dbus, 0: enable, 1: disable.*/
#define EXTMEM_DCACHE_SHUT_CORE1_BUS    (BIT(1))
#define EXTMEM_DCACHE_SHUT_CORE1_BUS_M  (BIT(1))
#define EXTMEM_DCACHE_SHUT_CORE1_BUS_V  0x1
#define EXTMEM_DCACHE_SHUT_CORE1_BUS_S  1
/* EXTMEM_DCACHE_SHUT_CORE0_BUS : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to disable core0 dbus, 0: enable, 1: disable.*/
#define EXTMEM_DCACHE_SHUT_CORE0_BUS    (BIT(0))
#define EXTMEM_DCACHE_SHUT_CORE0_BUS_M  (BIT(0))
#define EXTMEM_DCACHE_SHUT_CORE0_BUS_V  0x1
#define EXTMEM_DCACHE_SHUT_CORE0_BUS_S  0

#define EXTMEM_DCACHE_TAG_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x8)
/* EXTMEM_DCACHE_TAG_MEM_FORCE_PU : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to power dcache tag memory up, 0: follow  rtc_lslp_pd, 1: power
up.*/
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU    (BIT(2))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU_M  (BIT(2))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU_V  0x1
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU_S  2
/* EXTMEM_DCACHE_TAG_MEM_FORCE_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to power dcache tag memory down, 0: follow  rtc_lslp_pd, 1: powe
r down.*/
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD    (BIT(1))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD_M  (BIT(1))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD_V  0x1
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD_S  1
/* EXTMEM_DCACHE_TAG_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to close clock gating of dcache tag memory. 1: close gating, 0:
open clock gating..*/
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON    (BIT(0))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON_M  (BIT(0))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON_V  0x1
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON_S  0

#define EXTMEM_DCACHE_PRELOCK_CTRL_REG          (DR_REG_EXTMEM_BASE + 0xC)
/* EXTMEM_DCACHE_PRELOCK_SCT1_EN : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: The bit is used to enable the second section of prelock function..*/
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN    (BIT(1))
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN_M  (BIT(1))
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN_V  0x1
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN_S  1
/* EXTMEM_DCACHE_PRELOCK_SCT0_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: The bit is used to enable the first section of prelock function..*/
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN    (BIT(0))
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN_M  (BIT(0))
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN_V  0x1
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN_S  0

#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x10)
/* EXTMEM_DCACHE_PRELOCK_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to configure the first start virtual address of data prelock,
which is combined with DCACHE_PRELOCK_SCT0_SIZE_REG.*/
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_M  ((EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_V)<<(EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_S))
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_S  0

#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x14)
/* EXTMEM_DCACHE_PRELOCK_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The bits are used to configure the second start virtual address of data prelock,
 which is combined with DCACHE_PRELOCK_SCT1_SIZE_REG.*/
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_M  ((EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_V)<<(EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_S))
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_S  0

#define EXTMEM_DCACHE_PRELOCK_SCT_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x18)
/* EXTMEM_DCACHE_PRELOCK_SCT0_SIZE : R/W ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: The bits are used to configure the first length of data locking, which is combin
ed with DCACHE_PRELOCK_SCT0_ADDR_REG.*/
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE    0x0000FFFF
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_M  ((EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_V)<<(EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_S))
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_V  0xFFFF
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_S  16
/* EXTMEM_DCACHE_PRELOCK_SCT1_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the second length of data locking, which is combi
ned with DCACHE_PRELOCK_SCT1_ADDR_REG.*/
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE    0x0000FFFF
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_M  ((EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_V)<<(EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_S))
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_V  0xFFFF
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_S  0

#define EXTMEM_DCACHE_LOCK_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x1C)
/* EXTMEM_DCACHE_LOCK_DONE : RO ;bitpos:[2] ;default: 1'b1 ; */
/*description: The bit is used to indicate unlock/lock operation is finished..*/
#define EXTMEM_DCACHE_LOCK_DONE    (BIT(2))
#define EXTMEM_DCACHE_LOCK_DONE_M  (BIT(2))
#define EXTMEM_DCACHE_LOCK_DONE_V  0x1
#define EXTMEM_DCACHE_LOCK_DONE_S  2
/* EXTMEM_DCACHE_UNLOCK_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable unlock operation. It will be cleared by hardware after
 unlock operation done..*/
#define EXTMEM_DCACHE_UNLOCK_ENA    (BIT(1))
#define EXTMEM_DCACHE_UNLOCK_ENA_M  (BIT(1))
#define EXTMEM_DCACHE_UNLOCK_ENA_V  0x1
#define EXTMEM_DCACHE_UNLOCK_ENA_S  1
/* EXTMEM_DCACHE_LOCK_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to enable lock operation. It will be cleared by hardware after l
ock operation done..*/
#define EXTMEM_DCACHE_LOCK_ENA    (BIT(0))
#define EXTMEM_DCACHE_LOCK_ENA_M  (BIT(0))
#define EXTMEM_DCACHE_LOCK_ENA_V  0x1
#define EXTMEM_DCACHE_LOCK_ENA_S  0

#define EXTMEM_DCACHE_LOCK_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x20)
/* EXTMEM_DCACHE_LOCK_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address for lock operations. It
 should be combined with DCACHE_LOCK_SIZE_REG..*/
#define EXTMEM_DCACHE_LOCK_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_LOCK_ADDR_M  ((EXTMEM_DCACHE_LOCK_ADDR_V)<<(EXTMEM_DCACHE_LOCK_ADDR_S))
#define EXTMEM_DCACHE_LOCK_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_LOCK_ADDR_S  0

#define EXTMEM_DCACHE_LOCK_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x24)
/* EXTMEM_DCACHE_LOCK_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the length for lock operations. The bits are the
counts of cache block. It should be combined with DCACHE_LOCK_ADDR_REG..*/
#define EXTMEM_DCACHE_LOCK_SIZE    0x0000FFFF
#define EXTMEM_DCACHE_LOCK_SIZE_M  ((EXTMEM_DCACHE_LOCK_SIZE_V)<<(EXTMEM_DCACHE_LOCK_SIZE_S))
#define EXTMEM_DCACHE_LOCK_SIZE_V  0xFFFF
#define EXTMEM_DCACHE_LOCK_SIZE_S  0

#define EXTMEM_DCACHE_SYNC_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x28)
/* EXTMEM_DCACHE_SYNC_DONE : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The bit is used to indicate clean/writeback/invalidate operation is finished..*/
#define EXTMEM_DCACHE_SYNC_DONE    (BIT(3))
#define EXTMEM_DCACHE_SYNC_DONE_M  (BIT(3))
#define EXTMEM_DCACHE_SYNC_DONE_V  0x1
#define EXTMEM_DCACHE_SYNC_DONE_S  3
/* EXTMEM_DCACHE_CLEAN_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to enable clean operation. It will be cleared by hardware after
clean operation done..*/
#define EXTMEM_DCACHE_CLEAN_ENA    (BIT(2))
#define EXTMEM_DCACHE_CLEAN_ENA_M  (BIT(2))
#define EXTMEM_DCACHE_CLEAN_ENA_V  0x1
#define EXTMEM_DCACHE_CLEAN_ENA_S  2
/* EXTMEM_DCACHE_WRITEBACK_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bit is used to enable writeback operation. It will be cleared by hardware af
ter writeback operation done..*/
#define EXTMEM_DCACHE_WRITEBACK_ENA    (BIT(1))
#define EXTMEM_DCACHE_WRITEBACK_ENA_M  (BIT(1))
#define EXTMEM_DCACHE_WRITEBACK_ENA_V  0x1
#define EXTMEM_DCACHE_WRITEBACK_ENA_S  1
/* EXTMEM_DCACHE_INVALIDATE_ENA : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: The bit is used to enable invalidate operation. It will be cleared by hardware a
fter invalidate operation done..*/
#define EXTMEM_DCACHE_INVALIDATE_ENA    (BIT(0))
#define EXTMEM_DCACHE_INVALIDATE_ENA_M  (BIT(0))
#define EXTMEM_DCACHE_INVALIDATE_ENA_V  0x1
#define EXTMEM_DCACHE_INVALIDATE_ENA_S  0

