espressif/esp-idf/components/soc/esp32s3/include/soc/extmem_reg.h
#define EXTMEM_DCACHE_SYNC_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x2C)
/* EXTMEM_DCACHE_SYNC_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address for clean operations. I
t should be combined with DCACHE_SYNC_SIZE_REG..*/
#define EXTMEM_DCACHE_SYNC_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_SYNC_ADDR_M  ((EXTMEM_DCACHE_SYNC_ADDR_V)<<(EXTMEM_DCACHE_SYNC_ADDR_S))
#define EXTMEM_DCACHE_SYNC_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_SYNC_ADDR_S  0

#define EXTMEM_DCACHE_SYNC_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x30)
/* EXTMEM_DCACHE_SYNC_SIZE : R/W ;bitpos:[22:0] ;default: 23'h0 ; */
/*description: The bits are used to configure the length for sync operations. The bits are the
counts of cache block. It should be combined with DCACHE_SYNC_ADDR_REG..*/
#define EXTMEM_DCACHE_SYNC_SIZE    0x007FFFFF
#define EXTMEM_DCACHE_SYNC_SIZE_M  ((EXTMEM_DCACHE_SYNC_SIZE_V)<<(EXTMEM_DCACHE_SYNC_SIZE_S))
#define EXTMEM_DCACHE_SYNC_SIZE_V  0x7FFFFF
#define EXTMEM_DCACHE_SYNC_SIZE_S  0

#define EXTMEM_DCACHE_OCCUPY_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x34)
/* EXTMEM_DCACHE_OCCUPY_DONE : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: The bit is used to indicate occupy operation is finished..*/
#define EXTMEM_DCACHE_OCCUPY_DONE    (BIT(1))
#define EXTMEM_DCACHE_OCCUPY_DONE_M  (BIT(1))
#define EXTMEM_DCACHE_OCCUPY_DONE_V  0x1
#define EXTMEM_DCACHE_OCCUPY_DONE_S  1
/* EXTMEM_DCACHE_OCCUPY_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to enable occupy operation. It will be cleared by hardware after
 issuing Auot-Invalidate Operation..*/
#define EXTMEM_DCACHE_OCCUPY_ENA    (BIT(0))
#define EXTMEM_DCACHE_OCCUPY_ENA_M  (BIT(0))
#define EXTMEM_DCACHE_OCCUPY_ENA_V  0x1
#define EXTMEM_DCACHE_OCCUPY_ENA_S  0

#define EXTMEM_DCACHE_OCCUPY_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x38)
/* EXTMEM_DCACHE_OCCUPY_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address for occupy operation. I
t should be combined with DCACHE_OCCUPY_SIZE_REG..*/
#define EXTMEM_DCACHE_OCCUPY_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_OCCUPY_ADDR_M  ((EXTMEM_DCACHE_OCCUPY_ADDR_V)<<(EXTMEM_DCACHE_OCCUPY_ADDR_S))
#define EXTMEM_DCACHE_OCCUPY_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_OCCUPY_ADDR_S  0

#define EXTMEM_DCACHE_OCCUPY_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x3C)
/* EXTMEM_DCACHE_OCCUPY_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the length for occupy operation. The bits are the
 counts of cache block. It should be combined with DCACHE_OCCUPY_ADDR_REG..*/
#define EXTMEM_DCACHE_OCCUPY_SIZE    0x0000FFFF
#define EXTMEM_DCACHE_OCCUPY_SIZE_M  ((EXTMEM_DCACHE_OCCUPY_SIZE_V)<<(EXTMEM_DCACHE_OCCUPY_SIZE_S))
#define EXTMEM_DCACHE_OCCUPY_SIZE_V  0xFFFF
#define EXTMEM_DCACHE_OCCUPY_SIZE_S  0

#define EXTMEM_DCACHE_PRELOAD_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x40)
/* EXTMEM_DCACHE_PRELOAD_ORDER : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to configure the direction of preload operation. 1: descending,
0: ascending..*/
#define EXTMEM_DCACHE_PRELOAD_ORDER    (BIT(2))
#define EXTMEM_DCACHE_PRELOAD_ORDER_M  (BIT(2))
#define EXTMEM_DCACHE_PRELOAD_ORDER_V  0x1
#define EXTMEM_DCACHE_PRELOAD_ORDER_S  2
/* EXTMEM_DCACHE_PRELOAD_DONE : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: The bit is used to indicate preload operation is finished..*/
#define EXTMEM_DCACHE_PRELOAD_DONE    (BIT(1))
#define EXTMEM_DCACHE_PRELOAD_DONE_M  (BIT(1))
#define EXTMEM_DCACHE_PRELOAD_DONE_V  0x1
#define EXTMEM_DCACHE_PRELOAD_DONE_S  1
/* EXTMEM_DCACHE_PRELOAD_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bit is used to enable preload operation. It will be cleared by hardware afte
r preload operation done..*/
#define EXTMEM_DCACHE_PRELOAD_ENA    (BIT(0))
#define EXTMEM_DCACHE_PRELOAD_ENA_M  (BIT(0))
#define EXTMEM_DCACHE_PRELOAD_ENA_V  0x1
#define EXTMEM_DCACHE_PRELOAD_ENA_S  0

#define EXTMEM_DCACHE_PRELOAD_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x44)
/* EXTMEM_DCACHE_PRELOAD_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address for preload operation.
It should be combined with DCACHE_PRELOAD_SIZE_REG..*/
#define EXTMEM_DCACHE_PRELOAD_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_PRELOAD_ADDR_M  ((EXTMEM_DCACHE_PRELOAD_ADDR_V)<<(EXTMEM_DCACHE_PRELOAD_ADDR_S))
#define EXTMEM_DCACHE_PRELOAD_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_PRELOAD_ADDR_S  0

#define EXTMEM_DCACHE_PRELOAD_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x48)
/* EXTMEM_DCACHE_PRELOAD_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The bits are used to configure the length for preload operation. The bits are th
e counts of cache block. It should be combined with DCACHE_PRELOAD_ADDR_REG...*/
#define EXTMEM_DCACHE_PRELOAD_SIZE    0x0000FFFF
#define EXTMEM_DCACHE_PRELOAD_SIZE_M  ((EXTMEM_DCACHE_PRELOAD_SIZE_V)<<(EXTMEM_DCACHE_PRELOAD_SIZE_S))
#define EXTMEM_DCACHE_PRELOAD_SIZE_V  0xFFFF
#define EXTMEM_DCACHE_PRELOAD_SIZE_S  0

#define EXTMEM_DCACHE_AUTOLOAD_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x4C)
/* EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The bit is used to clear autoload buffer in dcache..*/
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR    (BIT(9))
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_M  (BIT(9))
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_V  0x1
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_S  9
/* EXTMEM_DCACHE_AUTOLOAD_SIZE : R/W ;bitpos:[8:7] ;default: 2'h0 ; */
/*description: The bits are used to configure the numbers of the cache block for the issuing au
toload operation..*/
#define EXTMEM_DCACHE_AUTOLOAD_SIZE    0x00000003
#define EXTMEM_DCACHE_AUTOLOAD_SIZE_M  ((EXTMEM_DCACHE_AUTOLOAD_SIZE_V)<<(EXTMEM_DCACHE_AUTOLOAD_SIZE_S))
#define EXTMEM_DCACHE_AUTOLOAD_SIZE_V  0x3
#define EXTMEM_DCACHE_AUTOLOAD_SIZE_S  7
/* EXTMEM_DCACHE_AUTOLOAD_RQST : R/W ;bitpos:[6:5] ;default: 2'b0 ; */
/*description: The bits are used to configure trigger conditions for autoload. 0/3: cache miss,
 1: cache hit, 2: both cache miss and hit..*/
#define EXTMEM_DCACHE_AUTOLOAD_RQST    0x00000003
#define EXTMEM_DCACHE_AUTOLOAD_RQST_M  ((EXTMEM_DCACHE_AUTOLOAD_RQST_V)<<(EXTMEM_DCACHE_AUTOLOAD_RQST_S))
#define EXTMEM_DCACHE_AUTOLOAD_RQST_V  0x3
#define EXTMEM_DCACHE_AUTOLOAD_RQST_S  5
/* EXTMEM_DCACHE_AUTOLOAD_ORDER : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bits are used to configure the direction of autoload. 1: descending, 0: asce
nding..*/
#define EXTMEM_DCACHE_AUTOLOAD_ORDER    (BIT(4))
#define EXTMEM_DCACHE_AUTOLOAD_ORDER_M  (BIT(4))
#define EXTMEM_DCACHE_AUTOLOAD_ORDER_V  0x1
#define EXTMEM_DCACHE_AUTOLOAD_ORDER_S  4
/* EXTMEM_DCACHE_AUTOLOAD_DONE : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: The bit is used to indicate autoload operation is finished..*/
#define EXTMEM_DCACHE_AUTOLOAD_DONE    (BIT(3))
#define EXTMEM_DCACHE_AUTOLOAD_DONE_M  (BIT(3))
#define EXTMEM_DCACHE_AUTOLOAD_DONE_V  0x1
#define EXTMEM_DCACHE_AUTOLOAD_DONE_S  3
/* EXTMEM_DCACHE_AUTOLOAD_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The bit is used to enable and disable autoload operation. It is combined with dc
ache_autoload_done. 1: enable, 0: disable. .*/
#define EXTMEM_DCACHE_AUTOLOAD_ENA    (BIT(2))
#define EXTMEM_DCACHE_AUTOLOAD_ENA_M  (BIT(2))
#define EXTMEM_DCACHE_AUTOLOAD_ENA_V  0x1
#define EXTMEM_DCACHE_AUTOLOAD_ENA_S  2
/* EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The bits are used to enable the second section for autoload operation..*/
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA    (BIT(1))
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_M  (BIT(1))
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_V  0x1
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_S  1
/* EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The bits are used to enable the first section for autoload operation..*/
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA    (BIT(0))
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_M  (BIT(0))
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_V  0x1
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_S  0

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x50)
/* EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The bits are used to configure the start virtual address of the first section fo
r autoload operation. It should be combined with dcache_autoload_sct0_ena..*/
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR    0xFFFFFFFF
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_M  ((EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_V)<<(EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_S))
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFF
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_S  0

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x54)
/* EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE : R/W ;bitpos:[26:0] ;default: 27'h0 ; */
/*description: The bits are used to configure the length of the first section for autoload oper
ation. It should be combined with dcache_autoload_sct0_ena..*/
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE    0x07FFFFFF
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_M  ((EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_V)<<(EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_S))
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_V  0x7FFFFFF
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_S  0

